leetcode_238_product_of_array_except_self.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 238. Product of Array Except Self</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Leetcode: 238. Product of Array Except Self</h1>

<div id="outline-container-orgc678793" class="outline-2">
<h2 id="orgc678793">Patterns</h2>
<div class="outline-text-2" id="text-orgc678793">
<ul class="org-ul">
<li><a href="pattern_find_cumulative_product_of_an_array.html#ID-E531AE8D-3BE5-486D-A28E-58828790F8E3">Pattern: Find cumulative product of an array</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0a0400b" class="outline-2">
<h2 id="org0a0400b">Prompts</h2>
<div class="outline-text-2" id="text-org0a0400b">
<ul class="org-ul">
<li><a href="can_you_break_down_the_problem_in_small_and_easily_to_solve_parts.html#ID-69D68202-BF1A-4D72-A0EC-DDCBAF112500">Can we break-down the problem in small and easily to solve parts?</a></li>

<li><a href="can_we_solve_the_problem_by_iterating_from_left_to_right_or_right_to_left.html#ID-C4FCF1BD-0D05-4D47-8FAB-B6002A8F4F09">Can we solve the problem by iterating from left to right (or right to left)?</a></li>
</ul>
</div>
</div>

<div id="outline-container-org6178b3a" class="outline-2">
<h2 id="org6178b3a">Solution</h2>
<div class="outline-text-2" id="text-org6178b3a">
<p>
The problem is specific about the time and space complexity.  It expects a solution with time complexity of \(O(n)\) and space complexity of \(O(1)\).  This is already a big hint for us, since we know that it is possible to solve the problem without using extra memory.  <a href="is_there_an_alternative_problem_easier_to_solve.html#ID-64E7E55B-09A9-4022-AB5E-1D25FC64EAC9">Is there an alternative problem easier to solve?</a>  Yes, there is: return \(answer\) where \(answer[i]=nums[0] \times nums[1] \times ... \times nums[i-1]\).  With a simple iteration, we can compute this \(answer\) without using extra memory.  If the problem were to find \(answer\) where \(answer[i]=nums[n-1] \times nums[n-2] \times ... \times nums[i+1]\), it can also be solved with a simple iteration.  Is it possible to combine these two problem and solve the original one?  Yes, but I will leave it for you to do.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">productExceptSelf</span>(<span style="font-weight: bold;">self</span>, nums: List[<span style="font-weight: bold;">int</span>]) -&gt; <span style="font-weight: bold; font-style: italic;">List</span>[<span style="font-weight: bold;">int</span>]:
        cur = 1
        <span style="font-weight: bold; font-style: italic;">ans</span> = []
        <span style="font-weight: bold;">for</span> n <span style="font-weight: bold;">in</span> <span style="font-weight: bold; font-style: italic;">nums</span>:
            ans.append(cur)
            cur = cur * n
        <span style="font-weight: bold; font-style: italic;">cur</span> = 1
        <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(<span style="font-weight: bold;">len</span>(nums) - 1, -1, -1):
            <span style="font-weight: bold; font-style: italic;">ans</span>[<span style="font-weight: bold; font-style: italic;">i</span>] = ans[i] * cur
            <span style="font-weight: bold; font-style: italic;">cur</span> = cur * nums[i]
        <span style="font-weight: bold;">return</span> ans
</pre>
</div>
</div>
</div>


<div id="outline-container-orgbb96082" class="outline-2">
<h2 id="orgbb96082">Cited by 1</h2>
<div class="outline-text-2" id="text-orgbb96082">
<ul class="org-ul">
<li><a href="interview_preparation_v.html#ID-8C7E9E52-9220-4A7B-B0E6-54F960E17CA8">Interview preparation: V</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>